<font size=6> Fuel Price in India </font>

The data is daily diesel price across the various city in India. The charge varies state to state has Indian state government levy extra tax on the fuel. The government changed over time. The new fuel charge update rule came into effect.

**Content**

The data consist of the date, fuel price and city name. There are a total of seven cities, such as Bengaluru, Chennai, Mumbai, Hyderabad, Delhi, Kolkata and Coimbatore.

* source: [mypetrolprice.com](https://www.mypetrolprice.com/diesel-price-in-india.aspx)

<center><img src='fuel_station.jpg'></center>

***
**Steps**
1. [Explore data set](#Explore-data-set)

# Import library

In [5]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
import os

# Import data set

In [2]:
path ='dataset/'
#path = '../input/'

df = pd.read_csv(path+'diesel.csv')
print('Number of rows and columns in data set',df.shape)

Number of rows and columns in data set (17235, 4)

In [24]:
# city = {1:"Bengaluru",2:"Chennai",3:"Mumbai",4:"Hyderabad",5:"Delhi",6:"Kolkata",7:"Coimbatore"}
# df['cityid'] = df['cityid'].replace(city)

In [10]:
state1 = {
    "Meerut": "Uttar Pradesh",
    "Varanasi": "Uttar Pradesh",
    "Allahabad": "Uttar Pradesh",
    "Madurai": "Tamil Nadu",
    "Shillong": "Meghalaya",
    "Karaikal": "Puducherry",
    "Aizwal": "Mizoram",
    "Dimapur": "Nagaland",
    "Agartala": "Tripura",
    "Nizamabad": "Telangana",
    "Pondicherry": "Pondicherry",
    "Haridwar": "Uttarakhand",
    "Bengaluru": "Karnataka",
    "Chennai": "Tamil Nadu",
    "Mumbai": "Maharashtra",
    "Hyderabad": "Telangana",
    "Delhi": "Delhi",
    "Kolkata": "West Bengal",
    "Coimbatore": "Tamil Nadu",
}

In [13]:
df['state'] = df['city'].replace(state1)

In [14]:
df.head()

    rate     city        date       state
0  18.23    Delhi  2002-06-16       Delhi
1  20.06  Chennai  2002-07-01  Tamil Nadu
2  18.23    Delhi  2002-07-01       Delhi
3  20.06  Chennai  2002-08-01  Tamil Nadu
4  18.23    Delhi  2002-08-01       Delhi

1. Bengaluru 
1. Chennai 
2. Mumbai 
3. Hyderabad 
4. Delhi 
5. Kolkata 
6. Coimbatore

In [28]:
# cols = ['BaseRate','cityid','Date']
# df1 = df[cols]
# columns = {'BaseRate':'rate','cityid':'city','Date':'date'}
# df1 = df1.rename(columns=columns)
# df.to_csv('dataset/diesel.csv',index=False)

In [3]:
path ='dataset/'
#path = '../input/'

df = pd.read_csv(path+'diesel.csv')
print('Number of rows and columns value data set',df.shape)

Number of rows and columns value data set (17235, 4)

In [4]:
df.tail()

           city        date   rate          state
17230  Varanasi  2020-12-27  74.84  Uttar Pradesh
17231  Varanasi  2020-12-28  74.84  Uttar Pradesh
17232  Varanasi  2020-12-29  74.84  Uttar Pradesh
17233  Varanasi  2020-12-30  74.84  Uttar Pradesh
17234  Varanasi  2020-12-31  74.84  Uttar Pradesh

In [5]:
files = []
for f in os.scandir('dataset/'):
    f = 'dataset/'+f.name
    d = pd.read_csv(f)
    files.append(d)

# combine
df_new = pd.concat(files,axis=0)
df_new = df_new.reset_index(drop=True)

In [5]:
drop_city = df_new.groupby('city').agg(cnt= ('city','count')).query('cnt <10 ').index.values
df_new1 = df_new[~df_new['city'].isin(drop_city)].reset_index(drop=True)

In [28]:
df_new1.groupby('city').agg(cnt= ('city','count'))

              cnt
city
Agartala      836
Aizwal        964
Allahabad     820
Bengaluru    1114
Chennai      1174
Coimbatore    966
Delhi        1174
Dimapur       824
Haridwar      408
Hyderabad    1118
Karaikal      408
Kolkata      1162
Madurai       824
Meerut        824
Mumbai       1174
Nizamabad     824
Pondicherry   968
Shillong      968
Varanasi      824

In [9]:
df_new['state'] = df_new['city'].replace(state1)

In [10]:
df_new['date'] = pd.to_datetime(df_new['date'])
df_new2 = df_new.query('date < "2021-01-01"').reset_index(drop=True)
df_new2.to_csv('diesel.csv',index=False)